system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:     v2506                              |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

Radius	1;					//Rayon / Coordonnées xy positives
L	50;					//Longueur / hauteur du tube
Nx	10;					//Nombre d'éléments d'un coté du carré central
Ny	5;					//Nombre d'éléments dans la couche limite
Nz	50;					//Nombre d'éléments dans la longueur
gr	0.45;					//Growth ratio ]0 - 1]

negRadius	#calc "-1*$Radius";		//Rayon / Coordonnées xy négatives
diagRadius	#calc "sqrt(2.)/2.*$Radius"; 	//Rayon / Coordonnées N-E [sqrt(2)/2 * R]
negDiagRadius	#calc "-1*$diagRadius"; 	//Rayon / Coordonnées S-O [sqrt(2)/2 * nR]
squareCorner	#calc "$diagRadius*2./3.";	//Coordonnée Sommet N-E carré central
negSquareCorner	#calc "$negDiagRadius*2./3."; 	//Coordonnée Sommet S-O carré central
arcSquare	#calc "$squareCorner*1.2";
negArcSquare	#calc "-1*$arcSquare";

vertices
(
    ($squareCorner $squareCorner 0)          	// 0
    ($diagRadius $diagRadius 0)          	// 1
    ($negSquareCorner $squareCorner 0)         	// 2
    ($negDiagRadius $diagRadius 0)         	// 3
    ($negSquareCorner $negSquareCorner 0)	// 4
    ($negDiagRadius $negDiagRadius 0)		// 5 
    ($squareCorner $negSquareCorner 0)		// 6
    ($diagRadius $negDiagRadius 0)		// 7 

    ($squareCorner $squareCorner $L)		// 8
    ($diagRadius $diagRadius $L)		// 9
    ($negSquareCorner $squareCorner $L)		// 10
    ($negDiagRadius $diagRadius $L)		// 11
    ($negSquareCorner $negSquareCorner $L)	// 12
    ($negDiagRadius $negDiagRadius $L)		// 13
    ($squareCorner $negSquareCorner $L)		// 14
    ($diagRadius $negDiagRadius $L)		// 15
);

blocks
(
    hex (0 2 4 6 8 10 12 14) ($Nx $Nx $Nz) simpleGrading (1 1 1)	// Square Core Block
    hex (0 1 3 2 8 9 11 10) ($Ny $Nx $Nz) simpleGrading ($gr 1 1)	// Positive Y Block
    hex (2 3 5 4 10 11 13 12) ($Ny $Nx $Nz) simpleGrading ($gr 1 1)	// Positive X Block
    hex (4 5 7 6 12 13 15 14) ($Ny $Nx $Nz) simpleGrading ($gr 1 1)	// Negative Y Block
    hex (6 7 1 0 14 15 9 8) ($Ny $Nx $Nz) simpleGrading ($gr 1 1)	// Negative X Block
);

edges
(
    arc 1 3 (0 $Radius 0)
    arc 3 5 ($negRadius 0 0)
    arc 5 7 (0 $negRadius 0)
    arc 7 1 ($Radius 0 0)

    arc 9 11  (0 $Radius $L)
    arc 11 13 ($negRadius 0 $L)
    arc 13 15 (0 $negRadius $L)
    arc 15 9  ($Radius 0 $L)
    
    arc 0 2 (0 $arcSquare 0)
    arc 2 4 ($negArcSquare 0 0)
    arc 4 6 (0 $negArcSquare 0)
    arc 6 0 ($arcSquare 0 0)
    
    arc 8 10  (0 $arcSquare $L)
    arc 10 12 ($negArcSquare 0 $L)
    arc 12 14 (0 $negArcSquare $L)
    arc 14 8  ($arcSquare 0 $L)
);

patches
(
    patch inlet
    (
        (0 2 4 6)
        (0 1 3 2)
        (2 3 5 4)
        (4 5 7 6)
        (6 7 1 0)
    )
    patch outlet
    (
        (8 10 12 14)
        (8 9 11 10)
        (10 11 13 12)
        (12 13 15 14)
        (14 15 9 8)
    )
    wall interface
    (
        (1 9 11 3)
        (3 11 13 5)
        (5 13 15 7)
        (7 15 9 1)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
