system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    //default         leastSquares;
    //grad(U)         faceMDLimited leastSquares 1;
}

divSchemes
{
    default         Gauss linear;
    //div(phi,U)      Gauss upwind;;
    //div(phi,U) Gauss linearUpwind grad(U);
    //div(phi,U) Gauss linearUpwind cellLimited leastSquares 1;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

    div(phi,omega) Gauss upwind;
    div(phi,k) Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    //interpolate(U) skewCorrected linear;
}

snGradSchemes
{
    default         corrected;
}


fluxRequired
{
    default    no;
    p;
}

// ************************************************************************* //
